from googletrans import Translator
translator = Translator()  
from_lang = 'nepali'
to_lang = 'english'

text = "यसका लागि राज्यले सबै क्षेत्रको अध्ययन-अध्यापन-अनुसन्धानलाई रोजगारीसँग जोडेर लैजान सक्नुपर्छ । अब प्राविधिक क्षेत्र मात्र ‘प्राविधिक’ रहेन, अध्ययनको हरेक विधा र पेशागत क्षेत्रसँग प्रविधि जोडिइसकेको छ । राज्यले अलिकति मात्रै गम्भीरता देखाएर योजना बनाउने हो भने कुनै पनि क्षेत्रमा धेरै रोजगारी सृजना हुन सक्छ र विद्यार्थी आˆनो रुचि र क्षमताको क्षेत्र रोज्न प्रेरित हुनेछन् यस क्रममा लिखित परीक्षाका उत्तरपुस्तिका परीक्षण गर्दा वा मौखिक परीक्षा लिंदा ‘ओहम्स ल’ समेत राम्रोसँग नबुझी चौथो वर्षमा पुगेका विद्यार्थी धेरै भेटेकोे छु । सामान्यभन्दा सामान्य सर्किट पनि जोड्न नसक्ने थुप्रै विद्यार्थी देखेको छु, जो एक-दुई महिनापछि नै आˆनो पढाइ सक्दै हुन्छन् । यस्ता विद्यार्थी कुन विश्वविद्यालयमा कति छन् भन्ने कुरातिर अहिले नजाउँ तर यस्ता विद्यार्थी जहाँसुकै पनि हुनु भनेको हाम्रो शिक्षा नीति र शिक्षण विधिमा ठूलैै खोट छ भन्ने कुराको प्रमाण हो ।"
translated_text = translator.translate(text,src=from_lang ,dest=to_lang, encoding='utf-8')
#print(translated_text)

with open('nepalitext.txt', 'r') as f:
    with open('nepalitext', 'w') as w:
        for line in f:
            line = line.strip()
            if line:
                w.write(line)
                w.write('\n')





f.close()


